12/data/attachments/2df16cf64e814be5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michael_specific_Friend_42291_9</nif:username>
            <nif:friendToBeRequested>soap_friends_ccb6364d-4e0a-4708-8176-7131e5e87116</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>